# Указываем от какого образа мы будем наследоваться
FROM node

# Задаем рабочую директорию внутри контейнера
# WORKDIR /app

# Далее указываем какие файлы мы хотим перенести в образ. Указываем два пути.
# Откуда копируем и куда копируем. Точка означает корневая директория
# Иными словами следующую запись мы читаем как из корневой директории где
# лежит докер файл копируем все файлы в директорию образа /app
COPY . .

# Далее после того как файлы скопированы, мы должны установить зависимости.
# Команда RUN выполнить в консоли следующую команду
RUN npm install

# Указываем на каком порту запустится приложение. Это порт внутри контейнера.
EXPOSE 3000

# Далее что бы запустить приложение мы должны выполнить в консоли команду
# npm run start. В этот раз нам нужно использовать другой оператора вызова команды.
# Этот оператор принимает массив с командами. Если бы нам нужно было выполнить node index.js
#  то команда выглядела вот так ["node","index.js"]
CMD ["npm", "start"]

# RUN и CMD отличаются тем, что RUN запускается при сборке образа, а CMD уже при запуске образа.